#### Terraform Format Check 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_organizations_organization.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-2]
data.aws_caller_identity.current: Read complete after 0s [id=445567079474]
aws_s3_object.terraform_remote_state: Refreshing state... [id=terraform-remote-state.yaml]
aws_s3_bucket.organisation_stacksets: Refreshing state... [id=organisation-stacksets-445567079474]
data.aws_organizations_organization.current: Read complete after 0s [id=o-hexz300bjw]
aws_cloudformation_stack.terraform_remote_state: Refreshing state... [id=terraform-remote-state]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudformation_stack.terraform_remote_state will be updated in-place
  ~ resource "aws_cloudformation_stack" "terraform_remote_state" {
        id                 = "terraform-remote-state"
        name               = "terraform-remote-state"
      ~ outputs            = {} -> (known after apply)
        tags               = {}
      ~ tags_all           = {
          + "terraform" = "true"
        }
      ~ template_url       = "https://organisation-stacksets-445567079474.s3.445567079474.amazonaws.com/terraform-remote-state.yaml" -> "https://organisation-stacksets-445567079474.s3.eu-west-2.amazonaws.com/terraform-remote-state.yaml"
        # (6 unchanged attributes hidden)
    }

  # aws_cloudformation_stack_set.terraform_remote_state will be created
  + resource "aws_cloudformation_stack_set" "terraform_remote_state" {
      + arn                 = (known after apply)
      + call_as             = "SELF"
      + capabilities        = [
          + "CAPABILITY_IAM",
          + "CAPABILITY_NAMED_IAM",
        ]
      + execution_role_name = (known after apply)
      + id                  = (known after apply)
      + name                = "terraform-remote-state"
      + parameters          = {
          + "GithubOrganisation" = "nvthvniel"
          + "GithubRepository"   = "aws-terraform"
        }
      + permission_model    = "SERVICE_MANAGED"
      + stack_set_id        = (known after apply)
      + tags_all            = {
          + "terraform" = "true"
        }
      + template_body       = (known after apply)
      + template_url        = "https://organisation-stacksets-445567079474.s3.eu-west-2.amazonaws.com/terraform-remote-state.yaml"

      + auto_deployment {
          + enabled                          = true
          + retain_stacks_on_account_removal = false
        }

      + operation_preferences {
          + failure_tolerance_count   = 1
          + max_concurrent_percentage = 100
        }
    }

  # aws_cloudformation_stack_set_instance.terraform_remote_state will be created
  + resource "aws_cloudformation_stack_set_instance" "terraform_remote_state" {
      + account_id               = (known after apply)
      + call_as                  = "SELF"
      + id                       = (known after apply)
      + organizational_unit_id   = (known after apply)
      + region                   = "eu-west-2"
      + retain_stack             = false
      + stack_id                 = (known after apply)
      + stack_instance_summaries = (known after apply)
      + stack_set_name           = "terraform-remote-state"

      + deployment_targets {
          + organizational_unit_ids = [
              + "r-t0l4",
            ]
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```